In [34]:
import pandas as pd

mid_data_load = "Data/mentorship_eligibilty.csv"

ml = pd.read_csv(student_data_load)

In [35]:
ml.head()

,emp_no,first_name,last_name,birth_date,from_date,to_date,title
0,10095,Hilari,Morton,1965-01-03,1994-03-10,9999-01-01,Senior Staff
1,10122,Ohad,Esposito,1965-01-19,1998-08-06,9999-01-01,Technique Leader
2,10291,Dipayan,Seghrouchni,1965-01-23,1987-03-30,9999-01-01,Senior Staff
3,10476,Kokou,Iisaka,1965-01-01,1987-09-20,9999-01-01,Senior Staff
4,10663,Teunis,Noriega,1965-01-09,1999-02-12,9999-01-01,Technique Leader

In [36]:
ml['emp_no'].count()

1549

In [37]:
total_mid = sd.groupby(["title"]).count()["emp_no"]

total_mid

title
Assistant Engineer     29
Engineer              190
Senior Engineer       529
Senior Staff          569
Staff                 155
Technique Leader       77
Name: emp_no, dtype: int64

In [38]:
total_mid.to_csv('mid.csv')